{
    "success": true,
    "data": {
        "details": {
            "name": "Ho Chi Minh's Mausoleum",
            "place_id": "ChIJF13BXqGrNTERTE3hz8KFDmI",
            "geometry": {
                "location": {
                    "lat": 21.0368973,
                    "lng": 105.8346667
                }
            },
            "formatted_address": "1 Hùng Vương, Điện Biên, Ba Đình, Hà Nội, Vietnam",
            "rating": 4.5,
            "user_ratings_total": 18947,
            "website": "https://www.bqllang.gov.vn/",
            "address_components": [
                {
                    "long_name": "Điện Biên, Ba Đình",
                    "short_name": "Điện Biên, Ba Đình",
                    "types": [
                        "sublocality_level_1",
                        "sublocality",
                        "political"
                    ]
                },
                {
                    "long_name": "Hanoi",
                    "short_name": "Hanoi",
                    "types": [
                        "locality",
                        "political"
                    ]
                },
                {
                    "long_name": "Vietnam",
                    "short_name": "VN",
                    "types": [
                        "country",
                        "political"
                    ]
                }
            ],
            "opening_hours": {
                "weekday_text": [
                    "Monday: 7 AM–5 PM",
                    "Tuesday: 7 AM–5 PM",
                    "Wednesday: 7 AM–5 PM",
                    "Thursday: 7 AM–5 PM",
                    "Friday: 7 AM–5 PM",
                    "Saturday: 7 AM–5 PM",
                    "Sunday: 7 AM–5 PM"
                ],
                "periods": [
                    {
                        "open": {
                            "day": 0,
                            "time": "0700"
                        },
                        "close": {
                            "day": 0,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 1,
                            "time": "0700"
                        },
                        "close": {
                            "day": 1,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 2,
                            "time": "0700"
                        },
                        "close": {
                            "day": 2,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 3,
                            "time": "0700"
                        },
                        "close": {
                            "day": 3,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 4,
                            "time": "0700"
                        },
                        "close": {
                            "day": 4,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 5,
                            "time": "0700"
                        },
                        "close": {
                            "day": 5,
                            "time": "1700"
                        }
                    },
                    {
                        "open": {
                            "day": 6,
                            "time": "0700"
                        },
                        "close": {
                            "day": 6,
                            "time": "1700"
                        }
                    }
                ]
            },
            "vicinity": "1 Hùng Vương, Điện Biên, Ba Đình, Hanoi",
            "types": [
                "historical_landmark",
                "cemetery",
                "tourist_attraction"
            ],
            "url": "https://maps.google.com/?ftid=0x3135aba15ec15d17:0x620e85c2cfe14d4c",
            "business_status": "OPERATIONAL",
            "photo_urls": [
                "https://lh3.googleusercontent.com/gps-cs-s/AC9h4nqozc_GH45tVVZpD4_GpKDk7yrh_RuQMRlz7U_XGVkp5h3hRzAcb_yyRf1qL127nNGKDNduzYm0q6BsN2Ssj2tUCmYPwLfB8-kTyDpr3OFFi58NoXy8WCNM12Hsl1HXEqvCqJGW",
                "https://lh3.googleusercontent.com/gps-cs-s/AC9h4nqPrt3PvknOTIgBx9nI7Rv2QSwNf5e_4guBhfigorNW86Pmsnn8hojLgxc3wnYDFqC1Ve6G1RPryaxUXST_DlUX-WEfcmv0m1m4_QPCK6gyKNzZtaSJ8CdBCMPLI-RV0KthAnt2"
            ]
        },
        "cardData": {
            "bookingInformation": null,
            "reviewCategories": [],
            "reviewsSummary": "The Ho Chi Minh Mausoleum in Hanoi, Vietnam, is a deeply moving and iconic landmark that offers insights into Vietnamese history and the pivotal role of Ho Chi Minh. Visitors are struck by the solemn atmosphere, reverence of other visitors, and the impressive mix of Vietnamese and Soviet architectural styles. The meticulously maintained gardens enhance the serene ambiance, while the staff work diligently to manage large crowds efficiently. Despite occasional issues with queue cutting and dress code enforcement discrepancies, complying with rules ensures a smooth experience at this must-visit historical site.",
            "reasonsToVisit": [
                "Experience a deeply moving and iconic landmark in Hanoi",
                "Gain insights into Vietnamese history and Ho Chi Minh's role",
                "Witness an impressive mix of Vietnamese and Soviet architectural styles",
                "Enjoy serene gardens surrounding the mausoleum",
                "Appreciate efficient crowd management despite high visitor numbers"
            ],
            "menuItems": [
                {
                    "name": "Dien Huu Temple",
                    "imageKey": "qqDR1cMbu6hFX3WxC2rDQEOZ0H3in2kN",
                    "captionURL": null
                }
            ],
            "tips": [
                "Arrive early in the morning to avoid long lines",
                "Dress modestly (knees must be covered) as a sign of respect",
                "Learn about regulations before visiting to ensure compliance",
                "Use southwest entrance for access to mausoleum specifically",
                "Be prepared for limited viewing time inside"
            ],
            "placeId": "ChIJF13BXqGrNTERTE3hz8KFDmI",
            "reviews": [
                {
                    "reviewId": "ChZDSUhNMG9nS0VJQ0FnTUR3djZISkhREAE",
                    "time": "2025-03-29T08:31:33.000Z",
                    "reviewerName": "Tien Nguyen Duy",
                    "rating": 5,
                    "rank": 1,
                    "reviewText": "The Ho Chi Minh Mausoleum, the president and prime minister of Vietnam is a place that you absolutely must visit when in Hanoi. Remember the regulations and how to dress. I recommend going in the early morning hours, because a few hours later there will be very long lines. Kindergartens, schools, students, military, civilians and tourists. The most crowded location. Please remember not to use your phone and take pictures in certain areas because they can take them away. In addition to the Mausoleum, there is the presidential palace, the building and the garden where the leader rested. There is also a museum, overall it is a really large area to visit."
                },
                {
                    "reviewId": "ChZDSUhNMG9nS0VQekgwTjNSbHV6Q0JBEAE",
                    "time": "2025-05-14T01:53:09.000Z",
                    "reviewerName": "Michael Case",
                    "rating": 4,
                    "rank": 1,
                    "reviewText": "Visited this complex which was an interesting experience. Need to be aware of the dress code (no shorts) and no bottles of water. Many school kids and long queues but moved quickly. Limited viewing time. Can also view the stilt house where Ho Chi Minh lived on and off from 1958 to 1969."
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VJQ0FnSUR2NTVDTHNnRRAB",
                    "time": "2024-12-24T19:30:28.000Z",
                    "reviewerName": "Mohsin Raza",
                    "rating": 5,
                    "rank": 2,
                    "reviewText": "The Ho Chi Minh Mausoleum is a deeply moving and iconic landmark in Hanoi, Vietnam. I was struck by the solemn atmosphere and the reverence of the visitors. The imposing structure, built with a mix of Vietnamese and Soviet architectural styles, is an impressive sight.\n\nThe meticulously maintained gardens surrounding the mausoleum add to its serene ambiance. The visit also offered insights into Vietnamese history and Ho Chi Minh's pivotal role in it. While the lines can be long, they move efficiently, and the wait is worth it.\n\nThe site is a testament to the deep admiration the Vietnamese people hold for their founding father. Overall, it’s a must-visit for anyone interested in history and culture."
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUNJa3Jqb3hBRRAB",
                    "time": "2025-03-31T16:48:21.000Z",
                    "reviewerName": "Eugenia Diva",
                    "rating": 5,
                    "rank": 2,
                    "reviewText": "Ho Chi Minh memoriam. A great place to go, however the queue is super long, with lots of local people cutting lines. Not recommended to go on the Weekends!\n\nMake sure that you don’t bring any digital cameras, foods, and drinks. Cause they do not allow those when you pass the security check."
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VLbjR4ZW1xc0pYRjRRRRAB",
                    "time": "2025-05-09T21:14:28.000Z",
                    "reviewerName": "John Winter",
                    "rating": 5,
                    "rank": 2,
                    "reviewText": "Ho Chi Minh’s Mausoleum is a must-visit in Hanoi for anyone interested in Vietnam’s history. The building is grand and solemn. The lines can be long, so it’s best to arrive early, and dress modestly as a sign of respect (knees must be covered). Security is tight, and the experience is quiet and formal. A powerful reminder of Vietnam’s past and a key cultural landmark.\n\nSaturday\t    7 am–6 pm\nSunday\t           7 am–6 pm\nMonday           7 am–6 pm\n(Vesak)            Hours might differ\nTuesday\t     7 am–6 pm\nWednesday.    7 am–6 pm\nThursday\t     7 am–6 pm\nFriday\t            7 am–6 pm"
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VJQ0FnTUNJZzhUd2x3RRAB",
                    "time": "2025-04-04T07:43:33.000Z",
                    "reviewerName": "Reza Sattarzadeh Nowbari",
                    "rating": 3,
                    "rank": 3,
                    "reviewText": "This is one of the most iconic structures in whole Hanoi. The complex is in a huge square in the middle of the city. There is the mausoleum itself, which is not accessible for the public to see Ho Chi Minh's body, and the his house and a museum in the northern part. The museum was also closed. It is better to go very early in the morning to avoid big crowds.\n\nConsider that they will not allow you with shorts into the complex. Unfortunately, this rule is only applied to those people who don't have blonde hair, blue eyes, and super white skin. If you belong to the aforementioned group, you can walk in shorts and shorts skirts.\n\nIt is truly unfortunate to see that the rules of etiquette are not applied equally."
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VJQ0FnTURRMV8yNXJnRRAB",
                    "time": "2025-03-15T05:38:49.000Z",
                    "reviewerName": "Như Thảo Lê",
                    "rating": 5,
                    "rank": 4,
                    "reviewText": "I saw a lot of negative comments about the staff at Ho Chi Minh Mausoleum. I visited on March 15, 2025, and it was not like that.\n\nPlease check the rules before visiting here. When you do it in the right way, no one can make trouble with you.\n\nBecause of the large number of visitors coming here every day, the coordinators here really have to work under pressure for hours. Local people constantly push and shove (this is really not good, but it is only a small part. We still have a high sense of responsibility for the rules here).\n\nI heard the staff say with the local that \"This is a line for foreigners to move, please do not push and shove, please be aware\".\n\nThey are doing their job well. Everything will be fine if everyone complies with the rules and follow the instructions quickly. In particular, you should learn the rules carefully before coming for everything smoothly. Best regards"
                },
                {
                    "reviewId": "ChdDSUhNMG9nS0VNcmlzcDdvc1pEZDhBRRAB",
                    "time": "2025-05-11T03:11:55.000Z",
                    "reviewerName": "AperolSpritz J",
                    "rating": 3,
                    "rank": 5,
                    "reviewText": "Visiting the mausoleum is a chaotic experience, to say the least.\n\nFirst, the dress code. See the photo. In no part of the etiquette rules says ‘shorts’ are not allowed. Actually, on my visit, I saw many wearing shorts and even open toed sandals/slippers were allowed.\n\nSecond, the wait, we visited on a Sunday when many locals were also lining up for the mausoleum. We arrived at 8:50 and got unto the building at 9:35. After we finished our viewing, the line had already been digested and dissipated. It seemed like by getting here early we ended up spending more time waiting in line.\n\nThird, which entrance to use. There are several entrances to the premise that includes the square and the mausoleum. For the mausoleum specifically, go to the [southwest corner], NOT the two checkpoints on either side of the square in front of the mausoleum.\n\nFourth, the presidential place and the fish pond require a ticket from foreigners. Locals get in for free.\n\nFifth, the viewing took about 1 minute. Visitors walk around the casket places in the center of a dark room that is lit by reddish light."
                }
            ]
        }
    }
}